"EMAIL" = "E-Mail";
"IN ORDER TO USE CUSTOM EMAIL SETTINGS YOU NEED A SMTP MAIL PROVIDER LIKE GMAIL" = "Για να χρησιμοποιήσετε το Ειδικό E-Mail πρέπει να έχετε έναν λογαριασμό σε μια υπηρεσία SMTP όπως το GMail.";
"USE CUSTOM MAIL SERVICE" = "Χρήση Ειδικής Υπηρεσίας E-Mail";
"MAIL DETAILS" = "Πληροφορίες E-Mail";
"EMAIL SETTINGS" = "Ρυθμίσεις E-Mail";